In [ ]:
#Instalar librerías
!pip install pandas
!pip install numpy
!pip install matplotlib

In [7]:
#Importar librerías: pandas y numpy
import pandas as pd 
import numpy as np
import io

#Leer el contenido del archivo
#df = pd.read_excel('Inmuebles.xlsx', index_col=2) 
df = pd.read_excel('Inmuebles.xlsx') 
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3337 entries, 0 to 3336
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Referencia    3337 non-null   int64
 1   Fecha Alta    3337 non-null   datetime64[ns]
 2   Tipo          3337 non-null   object
 3   Operación     3337 non-null   object
 4   Provincia     3337 non-null   object
 5   Superficie    3337 non-null   int64
 6   Precio Venta  3337 non-null   int64
 7   Fecha Venta   2759 non-null   datetime64[ns]
 8   Vendedor      2759 non-null   object
dtypes: datetime64[ns](2), int64(3), object(4)
memory usage: 234.8+ KB

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
0,1,2004-01-01,Parking,Alquiler,Lleida,291,2133903,2004-06-19,Carmen
1,2,2004-01-01,Local,Venta,Girona,199,1945424,2004-04-19,Pedro
2,3,2004-01-01,Oficina,Alquiler,Girona,82,712416,2004-11-08,Joaquín
3,4,2004-01-02,Parking,Alquiler,Girona,285,1815450,2004-04-27,Jesús
4,5,2004-01-02,Suelo,Venta,Tarragona,152,1138024,2004-07-10,María
...,...,...,...,...,...,...,...,...,...
3332,3333,2007-04-29,Industrial,Alquiler,Lleida,221,1450644,NaT,NaN
3333,3334,2007-04-29,Piso,Alquiler,Girona,55,454080,NaT,NaN
3334,3335,2007-04-30,Suelo,Venta,Tarragona,78,740688,NaT,NaN
3335,3336,2007-04-30,Piso,Alquiler,Barcelona,88,397408,NaT,NaN
3336,3337,2007-04-30,Parking,Venta,Lleida,254,2140712,NaT,NaN

In [3]:
#FILTROS BASICOS PARA VARIABLES CUALITATIVAS
#Conocer las operaciones de la provincia de Barcelona
#Filtro por objeto
filtro1=df[df["Provincia"] == "Barcelona"]
filtro1

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
12,13,2004-01-04,Parking,Venta,Barcelona,300,2937300,2004-11-04,Jesús
17,18,2004-01-06,Suelo,Venta,Barcelona,283,1679605,2004-06-06,Carmen
19,20,2004-01-08,Oficina,Alquiler,Barcelona,148,1169496,2004-08-19,María
20,21,2004-01-09,Industrial,Venta,Barcelona,228,2020992,2004-06-12,Carmen
24,25,2004-01-10,Oficina,Alquiler,Barcelona,124,1170684,2004-05-23,Jesús
...,...,...,...,...,...,...,...,...,...
3325,3326,2007-04-25,Industrial,Alquiler,Barcelona,296,2078216,NaT,NaN
3326,3327,2007-04-25,Suelo,Alquiler,Barcelona,161,999005,NaT,NaN
3328,3329,2007-04-26,Piso,Venta,Barcelona,264,2517504,NaT,NaN
3329,3330,2007-04-27,Parking,Venta,Barcelona,88,612568,NaT,NaN
3335,3336,2007-04-30,Piso,Alquiler,Barcelona,88,397408,NaT,NaN

In [4]:
#Convertir este primer filtro a CSV
filtro1.to_csv("filtro1.csv")

In [8]:
#Filtro por filas
#filtro2=df.iloc[500:600,: ] #Filas consecutivas
filtro2=df.iloc[ [1050, 2050, 3050] , : ]  #filas no consecutivas 
filtro2

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
1050,1051,2005-01-12,Parking,Venta,Lleida,246,1940448,2005-10-08,Pedro
2050,2051,2006-01-11,Parking,Venta,Tarragona,130,1275560,2006-11-13,María
3050,3051,2007-01-11,Casa,Venta,Barcelona,259,1369333,NaT,NaN

In [9]:
#Convertir el segundo filtro a CSV
filtro2.to_csv("filtro2.csv")

In [10]:
#Filtro por columnas
filtro3=df.iloc[ : , 3:6] #columnas consecutivas
#filtro3=df.iloc[ : , [3,6,8]]  #columnas no consecutivas 
filtro3

     Operación  Provincia  Superficie
0     Alquiler     Lleida         291
1        Venta     Girona         199
2     Alquiler     Girona          82
3     Alquiler     Girona         285
4        Venta  Tarragona         152
...        ...        ...         ...
3332  Alquiler     Lleida         221
3333  Alquiler     Girona          55
3334     Venta  Tarragona          78
3335  Alquiler  Barcelona          88
3336     Venta     Lleida         254

[3337 rows x 3 columns]

In [ ]:
#Convertir el tercer filtro a CSV
filtro3.to_csv("filtro3.csv")

In [5]:
#Filtro de filas vs columnas 
#Este filtro permite conocer los precios de venta de todos los locales y oficinas registrados en la base de datos
filtro4=df.loc[["Local","Oficina"], ["Precio Venta"]]
filtro4

         Precio Venta
Tipo
Local         1945424
Local          664700
Local          549780
Local          659330
Local          939072
...               ...
Oficina        394250
Oficina        293172
Oficina        807432
Oficina        463424
Oficina       1031320

[943 rows x 1 columns]

In [6]:
#Convertir el cuarto filtro a CSV
filtro4.to_csv("filtro4.csv")

In [8]:
#Filtro por cabecera
filtro5=df.head()
filtro5

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
0,1,2004-01-01,Parking,Alquiler,Lleida,291,2133903,2004-06-19,Carmen
1,2,2004-01-01,Local,Venta,Girona,199,1945424,2004-04-19,Pedro
2,3,2004-01-01,Oficina,Alquiler,Girona,82,712416,2004-11-08,Joaquín
3,4,2004-01-02,Parking,Alquiler,Girona,285,1815450,2004-04-27,Jesús
4,5,2004-01-02,Suelo,Venta,Tarragona,152,1138024,2004-07-10,María

In [9]:
#Convertir el quinto filtro a CSV
filtro5.to_csv("filtro5.csv")

In [17]:
#Filtro por comparacion
filtro6=df[df["Precio Venta"] > 2900000]
filtro6

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
12,13,2004-01-04,Parking,Venta,Barcelona,300,2937300,2004-11-04,Jesús
872,873,2004-11-09,Industrial,Alquiler,Lleida,295,2923155,2005-05-06,Luisa
2653,2654,2006-08-13,Piso,Alquiler,Girona,297,2909412,NaT,NaN
2696,2697,2006-08-31,Oficina,Venta,Barcelona,298,2977318,NaT,NaN
3125,3126,2007-02-10,Oficina,Venta,Tarragona,297,2902284,NaT,NaN
3267,3268,2007-04-01,Industrial,Alquiler,Barcelona,300,2908500,NaT,NaN
3288,3289,2007-04-09,Parking,Venta,Lleida,296,2914416,NaT,NaN

In [18]:
#Convertir el sexto filtro a CSV
filtro6.to_csv("filtro6.csv")

In [26]:
#FILTROS BASICOS CON CONETORES LOGICOS
#Filtro Y
filtro7=df[(df["Superficie"] >= 290) & (df["Tipo"] == "Casa")]
filtro7

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
290,291,2004-04-21,Casa,Alquiler,Tarragona,295,1877675,2004-09-11,Pedro
303,304,2004-04-26,Casa,Alquiler,Barcelona,298,2612566,2005-02-16,Pedro
610,611,2004-08-11,Casa,Venta,Barcelona,294,2658936,2005-06-21,Luisa
759,760,2004-09-26,Casa,Alquiler,Barcelona,299,1695330,2005-07-14,Joaquín
1466,1467,2005-06-09,Casa,Venta,Lleida,299,2333097,2005-09-15,María
1560,1561,2005-07-15,Casa,Alquiler,Barcelona,291,1823406,2006-05-02,Pedro
1742,1743,2005-09-17,Casa,Venta,Girona,292,2630336,2006-01-08,Joaquín
2375,2376,2006-05-01,Casa,Alquiler,Tarragona,296,2813776,2006-10-22,Luisa
2386,2387,2006-05-04,Casa,Venta,Girona,294,1784580,2007-01-28,Luisa
2389,2390,2006-05-05,Casa,Venta,Lleida,290,1853390,2007-05-01,Luisa
2612,2613,2006-07-28,Casa,Venta,Barcelona,294,2618364,NaT,NaN
2708,2709,2006-09-06,Casa,Alquiler,Girona,291,1643568,NaT,NaN
2778,2779,2006-10-04,Casa,Venta,Girona,295,1658785,NaT,NaN
3006,3007,2006-12-26,Casa,Alquiler,Girona,297,2673000,NaT,NaN
3058,3059,2007-01-14,Casa,Alquiler,Lleida,290,2797050,NaT,NaN
3235,3236,2007-03-20,Casa,Alquiler,Girona,292,2765240,NaT,NaN

In [27]:
#Convertir el séptimo filtro a CSV
filtro7.to_csv("filtro7.csv")

In [44]:
#Filtro o 
filtro8=df[(df["Superficie"] > 250) | (df["Provincia"] == "Girona")]
filtro8

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
0,1,2004-01-01,Parking,Alquiler,Lleida,291,2133903,2004-06-19,Carmen
1,2,2004-01-01,Local,Venta,Girona,199,1945424,2004-04-19,Pedro
2,3,2004-01-01,Oficina,Alquiler,Girona,82,712416,2004-11-08,Joaquín
3,4,2004-01-02,Parking,Alquiler,Girona,285,1815450,2004-04-27,Jesús
5,6,2004-01-03,Industrial,Alquiler,Girona,131,953156,2004-09-05,Pedro
...,...,...,...,...,...,...,...,...,...
3325,3326,2007-04-25,Industrial,Alquiler,Barcelona,296,2078216,NaT,NaN
3328,3329,2007-04-26,Piso,Venta,Barcelona,264,2517504,NaT,NaN
3330,3331,2007-04-27,Local,Venta,Girona,110,845790,NaT,NaN
3333,3334,2007-04-29,Piso,Alquiler,Girona,55,454080,NaT,NaN
3336,3337,2007-04-30,Parking,Venta,Lleida,254,2140712,NaT,NaN

In [45]:
#Convertir el octavo filtro a CSV
filtro8.to_csv("filtro8.csv")

In [48]:
#Filtro not
filtro9=df[~(df["Operación"] == "Venta")]
filtro9

,Referencia,Fecha Alta,Tipo,Operación,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor
0,1,2004-01-01,Parking,Alquiler,Lleida,291,2133903,2004-06-19,Carmen
2,3,2004-01-01,Oficina,Alquiler,Girona,82,712416,2004-11-08,Joaquín
3,4,2004-01-02,Parking,Alquiler,Girona,285,1815450,2004-04-27,Jesús
5,6,2004-01-03,Industrial,Alquiler,Girona,131,953156,2004-09-05,Pedro
6,7,2004-01-03,Parking,Alquiler,Tarragona,69,406686,2004-06-07,Pedro
...,...,...,...,...,...,...,...,...,...
3325,3326,2007-04-25,Industrial,Alquiler,Barcelona,296,2078216,NaT,NaN
3326,3327,2007-04-25,Suelo,Alquiler,Barcelona,161,999005,NaT,NaN
3332,3333,2007-04-29,Industrial,Alquiler,Lleida,221,1450644,NaT,NaN
3333,3334,2007-04-29,Piso,Alquiler,Girona,55,454080,NaT,NaN
3335,3336,2007-04-30,Piso,Alquiler,Barcelona,88,397408,NaT,NaN

In [49]:
#Convertir el noveno filtro a CSV
filtro9.to_csv("filtro9.csv")